Revit 2024 API
FamilyItemFactory.NewRadialDimension Method (View, Reference, XYZ, DimensionType)
 Generate a new radial dimension object using a specified dimension type.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public Dimension NewRadialDimension(
	View view,
	Reference arcRef,
	XYZ origin,
	DimensionType dimensionType
)
Visual Basic
Public Function NewRadialDimension ( _
	view As View, _
	arcRef As Reference, _
	origin As XYZ, _
	dimensionType As DimensionType _
) As Dimension
Visual C++
public:
Dimension^ NewRadialDimension(
	View^ view,
	Reference^ arcRef,
	XYZ^ origin,
	DimensionType^ dimensionType
)
Parameters
view
Type: Autodesk.Revit.DB.View
 The view in which the dimension is to be visible.
arcRef
Type: Autodesk.Revit.DB.Reference
 Geometric reference of the arc to which the dimension is to be bound.
origin
Type: Autodesk.Revit.DB.XYZ
 The point where the witness line of the radial dimension will lie.
dimensionType
Type: Autodesk.Revit.DB.DimensionType
 The dimension style to be used for the dimension.
Return Value
If creation was successful the new arc length dimension is returned, otherwise an exception with failure information will be thrown.
Remarks
 The dimension will be created on default place.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  Thrown when any input argument is null.
Autodesk.Revit.Exceptions.ArgumentException |  Thrown when the argument arcRef/dimensionType is invalid.
Autodesk.Revit.Exceptions.InvalidOperationException |  Thrown when the creation failed.
See Also
FamilyItemFactory Class
NewRadialDimension Overload
Autodesk.Revit.Creation Namespace